Creates a new linear dimension object.
 Overload List
Name  |   Description
NewDimension(View, Line, ReferenceArray)
 Creates a new linear dimension object using the default dimension style.
 (Inherited from  ItemFactoryBase  .)
NewDimension(View, Line, ReferenceArray, DimensionType)
 Creates a new linear dimension object using the specified dimension style.
 (Inherited from  ItemFactoryBase  .)
 See Also
  FamilyItemFactory Class
  FamilyItemFactory Members
  Autodesk.Revit.Creation Namespace